// Дано число из отрезка [10, 99]. Показать наибольшую цифру числа

int a = new Random().Next(10, 99);

Console.WriteLine(a);
Console.WriteLine();



Console.WriteLine(max);
